GetCropRegionShapeManager Method
 Returns an object for managing view crop region shape.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public ViewCropRegionShapeManager GetCropRegionShapeManager()
  Visual Basic
Public Function GetCropRegionShapeManager As ViewCropRegionShapeManager
  Visual C++
public:
ViewCropRegionShapeManager^ GetCropRegionShapeManager()
 Return Value
 The crop region shape manager.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →